---
kind: property
id: P:Autodesk.Revit.DB.SpatialElementCalculationLocation.MarkerPosition
source: html/11e13d93-8417-5f44-b33f-3f2ac4169d59.htm
---
# Autodesk.Revit.DB.SpatialElementCalculationLocation.MarkerPosition Property

The position of the spatial element calculation location marker.

## Syntax (C#)
```csharp
public XYZ MarkerPosition { get; }
```